pmo-dataset/variations/graphviz_basic/04.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "ParallelGateway_5" -> "Analyze performance for future optimization";
  "ParallelGateway_3" -> "Select promotion channels";
  "ParallelGateway_5" -> "ParallelGateway_4";
  "ParallelGateway_6" -> "Collect leads in CRM system";
  "ExclusiveGateway_1" -> "ParallelGateway_4";
  "Track performance in real-time" -> "ParallelGateway_5";
  "ParallelGateway_3" -> "Design visuals";
  "Define campaign objectives" -> "ParallelGateway_3";
  "ExclusiveGateway_2" -> "ExclusiveGateway_1";
  "Campaign period ends" -> "ParallelGateway_2";
  "Select promotion channels" -> "ParallelGateway_1";
  "ExclusiveGateway_2" -> "Sales teams follows up on leads";
  "Analyze performance for future optimization" -> "ParallelGateway_2";
  "Collect leads in CRM system" -> "ExclusiveGateway_2";
  "Design visuals" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "Launch campaign";
  "Launch campaign" -> "ParallelGateway_6";
  "ParallelGateway_2" -> "end";
  "ParallelGateway_4" -> "Campaign period ends";
  "ParallelGateway_6" -> "Track performance in real-time";
  "start" -> "Define campaign objectives";
  "Sales teams follows up on leads" -> "ExclusiveGateway_1";
  "Create content" -> "ParallelGateway_1";
  "ParallelGateway_3" -> "Create content";

  "start" [shape=circle, label="start"];
  "end" [shape=circle, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];
  "ParallelGateway_5" [shape=diamond, label="+"];
  "ParallelGateway_6" [shape=diamond, label="+"];
}
