pmo-dataset/variations/mermaid_with_ids/04.mmd
graph LR
	classDef endEvent stroke-width:3px
	Task_1["Create content"]
	Task_2["Sales teams follows\nup on leads"]
	Task_3["Track performance in\nreal-time"]
	Task_4["Collect leads in CRM\nsystem"]
	Task_5["Select promotion\nchannels"]
	Task_6["Analyze performance\nfor future\noptimization"]
	Task_7["Launch campaign"]
	Task_8["Define campaign\nobjectives"]
	Task_9["Campaign period ends"]
	Task_10["Design visuals"]
	StartNoneEvent_1(("start"))
	EndNoneEvent_1(("end")):::endEvent
	ExclusiveGateway_1{"X"}
	ExclusiveGateway_2{"X"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}
	ParallelGateway_3{"+"}
	ParallelGateway_4{"+"}
	ParallelGateway_5{"+"}
	ParallelGateway_6{"+"}

	ParallelGateway_5 --> Task_6
	ParallelGateway_3 --> Task_5
	ParallelGateway_5 --> ParallelGateway_4
	ParallelGateway_6 --> Task_4
	ExclusiveGateway_1 --> ParallelGateway_4
	Task_3 --> ParallelGateway_5
	ParallelGateway_3 --> Task_10
	Task_8 --> ParallelGateway_3
	ExclusiveGateway_2 --> ExclusiveGateway_1
	Task_9 --> ParallelGateway_2
	Task_5 --> ParallelGateway_1
	ExclusiveGateway_2 --> Task_2
	Task_6 --> ParallelGateway_2
	Task_4 --> ExclusiveGateway_2
	Task_10 --> ParallelGateway_1
	ParallelGateway_1 --> Task_7
	Task_7 --> ParallelGateway_6
	ParallelGateway_2 --> EndNoneEvent_1
	ParallelGateway_4 --> Task_9
	ParallelGateway_6 --> Task_3
	StartNoneEvent_1 --> Task_8
	Task_2 --> ExclusiveGateway_1
	Task_1 --> ParallelGateway_1
	ParallelGateway_3 --> Task_1
